Autodesk.Revit.DB.HasValueFilterRule.#ctor(Autodesk.Revit.DB.ElementId)
constructs an instance of HasValueFilterRule.
parameter:
The parameter that an element must have a value for to pass this rule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020